### Pandas - DataFrame and Series

In [2]:
import pandas as pd

In [9]:
## Series 
## A Pandas Series is a one-dimensional array like object that can hold any data type. It is similar to a column ina table.

import pandas as pd
data = [1,2,3,4,5,6]
series = pd.Series(data)
print("series \n",series)

series
 0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [11]:
## create a series from Dictionary

data={'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [12]:
data = [10,20,30,40]
index= {'a','b','c','d'}
pd.Series(data,index=index)

b    10
c    20
a    30
d    40
dtype: int64

In [67]:
## DataFrame
## create a Dataframe from a dictionary of list

data = {
    'Name':['Aadi','Shivam','Gautam'],
    'Age':[28,23,25],
    'City':['Vadodara','Sonpur','Delhi']
}
df= pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age      City
0    Aadi   28  Vadodara
1  Shivam   23    Sonpur
2  Gautam   25     Delhi
<class 'pandas.core.frame.DataFrame'>

In [41]:
import numpy as np
np.array(df)

array([['Aadi', '28', 'Vadodara'],
       ['Shivam', '23', 'Sonpur'],
       ['Gautam', '25', 'Delhi']], dtype=object)

In [15]:
## create a data frame from a List of a Dictionary

data = [
    {'Name':'Aadi','Age':25,'city':'Vadodara'},
    {'Name':'Shiv','Age':23,'city':'Patna'},
    {'Name':'Gautam','Age':14,'city':'Delhi'}
]
df= pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age      city
0    Aadi   25  Vadodara
1    Shiv   23     Patna
2  Gautam   14     Delhi
<class 'pandas.core.frame.DataFrame'>

In [75]:
df=pd.read_csv('data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [17]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [25]:
### Accessing data from Dataframe
df

     Name  Age      City
0    Aadi   28  Vadodara
1  Shivam   23    Sonpur
2  Gautam   25     Delhi

In [31]:
df['Name']

0      Aadi
1    Shivam
2    Gautam
Name: Name, dtype: object

In [28]:
df.loc[0]

Name        Aadi
Age           28
City    Vadodara
Name: 0, dtype: object

In [29]:
df.iloc[2][0]

C:\Users\aadit\AppData\Local\Temp\ipykernel_15000\500358526.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[2][0]

'Gautam'

In [42]:
df

     Name Age      City
0    Aadi  28  Vadodara
1  Shivam  23    Sonpur
2  Gautam  25     Delhi

In [43]:
## Accessing a Specified element
df.at[2,'Age']

'25'

In [45]:
df.at[2,'Name']

'Gautam'

In [46]:
## Accessing a specified element using iat
df.iat[2,2]

'Delhi'

In [47]:
## Data Manipulation with DataFrame
df

     Name Age      City
0    Aadi  28  Vadodara
1  Shivam  23    Sonpur
2  Gautam  25     Delhi

In [60]:
## Adding a column 
df['Salary']=[50000,45000,60000]
df

     Name Age      City  Salary
0    Aadi  28  Vadodara   50000
1  Shivam  23    Sonpur   45000
2  Gautam  25     Delhi   60000

In [61]:
## Remove a column
df.drop('Salary',axis=1)

     Name Age      City
0    Aadi  28  Vadodara
1  Shivam  23    Sonpur
2  Gautam  25     Delhi

In [62]:
df

     Name Age      City  Salary
0    Aadi  28  Vadodara   50000
1  Shivam  23    Sonpur   45000
2  Gautam  25     Delhi   60000

In [63]:
## Remove a column permanently
df.drop('Salary',axis=1,inplace=True)

In [59]:
df

     Name Age      City
0    Aadi  28  Vadodara
1  Shivam  23    Sonpur
2  Gautam  25     Delhi

In [ ]:
## Add age to the column
df['Age']=df['Age']+1

In [72]:
df

     Name  Age      City
0    Aadi   29  Vadodara
1  Shivam   24    Sonpur
2  Gautam   26     Delhi

In [76]:
df=pd.read_csv('data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [ ]:
# Describe the data types of each column
print("Data types: \n",df.dtypes)

Data types:
 Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object
Statistical summary:
 <bound method NDFrame.describe of           Date Category  Value   Product  Sales Region
0   2023-01-01        A   28.0  Product1  754.0   East
1   2023-01-02        B   39.0  Product3  110.0  North
2   2023-01-03        C   32.0  Product2  398.0   East
3   2023-01-04        B    8.0  Product1  522.0   East
4   2023-01-05        B   26.0  Product3  869.0  North
5   2023-01-06        B   54.0  Product3  192.0   West
6   2023-01-07        A   16.0  Product1  936.0   East
7   2023-01-08        C   89.0  Product1  488.0   West
8   2023-01-09        C   37.0  Product3  772.0   West
9   2023-01-10        A   22.0  Product2  834.0   West
10  2023-01-11        B    7.0  Product1  842.0  North
11  2023-01-12        B   60.0  Product2    NaN   West
12  2023-01-13        A   70.0  Product3  628.0  South
13  2023-01-14        A   69.0  Product1  423.0   East
14  2023-01-15        A   47.0  Product2  893.0   West
15  2023-01-16        C    NaN  Product1  895.0  North
16  2023-01-17        C   93.0  Product2  511.0  South
17  2023-01-18        C    NaN  Product1  108.0   West
18  2023-01-19        A   31.0  Product2  578.0   West
19  2023-01-20        A   59.0  Product1  736.0   East
20  2023-01-21        C   82.0  Product3  606.0  South
21  2023-01-22        C   37.0  Product2  992.0  South
22  2023-01-23        B   62.0  Product3  942.0  North
23  2023-01-24        C   92.0  Product2  342.0   West
24  2023-01-25        A   24.0  Product2  458.0   East
25  2023-01-26        C   95.0  Product1  584.0   West
26  2023-01-27        C   71.0  Product2  619.0  North
27  2023-01-28        C   56.0  Product2  224.0  North
28  2023-01-29        B    NaN  Product3  617.0  North
29  2023-01-30        C   51.0  Product2  737.0  South
30  2023-01-31        B   50.0  Product3  735.0   West
31  2023-02-01        A   17.0  Product2  189.0   West
32  2023-02-02        B   63.0  Product3  338.0  South
33  2023-02-03        C   27.0  Product3    NaN   East
34  2023-02-04        C   70.0  Product3  669.0   West
35  2023-02-05        B   60.0  Product2    NaN   West
36  2023-02-06        C   36.0  Product3  177.0   East
37  2023-02-07        C    2.0  Product1    NaN  North
38  2023-02-08        C   94.0  Product1  408.0  South
39  2023-02-09        A   62.0  Product1  155.0   West
40  2023-02-10        B   15.0  Product1  578.0   East
41  2023-02-11        C   97.0  Product1  256.0   East
42  2023-02-12        A   93.0  Product3  164.0   West
43  2023-02-13        A   43.0  Product3  949.0   East
44  2023-02-14        A   96.0  Product3  830.0   East
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North>
Mean value by category:
 Category
A    48.357143
B    44.142857
C    59.842105
Name: Value, dtype: float64

In [81]:
# Describe the DataFrame
print("Statistical summary: \n",df.describe())

Statistical summary:
            Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [80]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [82]:
# Group by a column and perform an aggregation
grouped = df.groupby('Category')['Value'].mean()
print("Mean value by category: \n",grouped)

Mean value by category:
 Category
A    48.357143
B    44.142857
C    59.842105
Name: Value, dtype: float64